In [1]:
import numpy as np
import pandas as pd

# NaN

In [ ]:
Nan = not a number

In [2]:
x = pd.DataFrame([['Zoe', 32, np.nan, 59, 'banana'],
                  ['Sam', np.nan, 'M', np.nan, 'peach'],
                  ['Danny', 46, 'M', 81, 'apple']], columns=['name', 'age', 'sex', 'grade', 'fruit'])
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [3]:
x.isnull()

    name    age    sex  grade  fruit
0  False  False   True  False  False
1  False   True  False   True  False
2  False  False  False  False  False

In [4]:
x.isnull().sum()

name     0
age      1
sex      1
grade    1
fruit    0
dtype: int64

In [5]:
x.isna().sum()

name     0
age      1
sex      1
grade    1
fruit    0
dtype: int64

In [6]:
x.notnull()

   name    age    sex  grade  fruit
0  True   True  False   True   True
1  True  False   True  False   True
2  True   True   True   True   True

In [7]:
x.notnull().sum()

name     3
age      2
sex      2
grade    2
fruit    3
dtype: int64

In [8]:
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [9]:
x.dropna()

    name   age sex  grade  fruit
2  Danny  46.0   M   81.0  apple

In [10]:
x.dropna(subset=['sex'])

    name   age sex  grade  fruit
1    Sam   NaN   M    NaN  peach
2  Danny  46.0   M   81.0  apple

In [11]:
x.fillna(99)

    name   age sex  grade   fruit
0    Zoe  32.0  99   59.0  banana
1    Sam  99.0   M   99.0   peach
2  Danny  46.0   M   81.0   apple

In [12]:
x.fillna('yes')

    name   age  sex grade   fruit
0    Zoe  32.0  yes  59.0  banana
1    Sam   yes    M   yes   peach
2  Danny  46.0    M  81.0   apple

In [13]:
x.fillna(x.mean())

/var/folders/f4/zng18hd13w107g5gbzgjsk440000gp/T/ipykernel_41120/2029865756.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  x.fillna(x.mean())

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam  39.0    M   70.0   peach
2  Danny  46.0    M   81.0   apple

In [14]:
x.fillna(x.min())

/var/folders/f4/zng18hd13w107g5gbzgjsk440000gp/T/ipykernel_41120/4621098.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  x.fillna(x.min())

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam  32.0    M   59.0   peach
2  Danny  46.0    M   81.0   apple

In [15]:
x.fillna(x.max())

/var/folders/f4/zng18hd13w107g5gbzgjsk440000gp/T/ipykernel_41120/1537557738.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  x.fillna(x.max())

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam  46.0    M   81.0   peach
2  Danny  46.0    M   81.0   apple

In [18]:
x['age'].fillna(0)

0    32.0
1     0.0
2    46.0
Name: age, dtype: float64

In [19]:
x.fillna({'age': 22, 'sex': 'F', 'grade': 44})

    name   age sex  grade   fruit
0    Zoe  32.0   F   59.0  banana
1    Sam  22.0   M   44.0   peach
2  Danny  46.0   M   81.0   apple

## append

In [20]:
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [21]:
x.append(x)

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [22]:
x.append(x, ignore_index=True)

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple
3    Zoe  32.0  NaN   59.0  banana
4    Sam   NaN    M    NaN   peach
5  Danny  46.0    M   81.0   apple

In [23]:
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [24]:
x.set_index('name')

        age  sex  grade   fruit
name
Zoe    32.0  NaN   59.0  banana
Sam     NaN    M    NaN   peach
Danny  46.0    M   81.0   apple

In [25]:
x = x.set_index('name')
x

        age  sex  grade   fruit
name
Zoe    32.0  NaN   59.0  banana
Sam     NaN    M    NaN   peach
Danny  46.0    M   81.0   apple

In [27]:
x.loc['Zoe']

age        32.0
sex         NaN
grade      59.0
fruit    banana
Name: Zoe, dtype: object

In [28]:
x

        age  sex  grade   fruit
name
Zoe    32.0  NaN   59.0  banana
Sam     NaN    M    NaN   peach
Danny  46.0    M   81.0   apple

In [30]:
x = x.reset_index()
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [31]:
x = x.append(x, ignore_index=True)
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple
3    Zoe  32.0  NaN   59.0  banana
4    Sam   NaN    M    NaN   peach
5  Danny  46.0    M   81.0   apple

In [32]:
x.drop_duplicates()

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [33]:
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple
3    Zoe  32.0  NaN   59.0  banana
4    Sam   NaN    M    NaN   peach
5  Danny  46.0    M   81.0   apple

In [34]:
x.drop_duplicates('name')

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [35]:
x.drop_duplicates('sex')

  name   age  sex  grade   fruit
0  Zoe  32.0  NaN   59.0  banana
1  Sam   NaN    M    NaN   peach

In [36]:
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple
3    Zoe  32.0  NaN   59.0  banana
4    Sam   NaN    M    NaN   peach
5  Danny  46.0    M   81.0   apple

In [37]:
x.drop_duplicates(keep='first')

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [38]:
x.drop_duplicates(keep='last')

    name   age  sex  grade   fruit
3    Zoe  32.0  NaN   59.0  banana
4    Sam   NaN    M    NaN   peach
5  Danny  46.0    M   81.0   apple

In [39]:
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple
3    Zoe  32.0  NaN   59.0  banana
4    Sam   NaN    M    NaN   peach
5  Danny  46.0    M   81.0   apple

## function & mapping

In [41]:
x = x.drop_duplicates()

In [42]:
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [43]:
x = x.fillna({'sex': 'F', 'grade': 65})
x

    name   age sex  grade   fruit
0    Zoe  32.0   F   59.0  banana
1    Sam   NaN   M   65.0   peach
2  Danny  46.0   M   81.0   apple

In [44]:
sex = {'M': 1, 'F': 0}

In [46]:
x['sex_map'] = x['sex'].map(sex)

In [47]:
x

    name   age sex  grade   fruit  sex_map
0    Zoe  32.0   F   59.0  banana        0
1    Sam   NaN   M   65.0   peach        1
2  Danny  46.0   M   81.0   apple        1

In [48]:
def letter_grade(grade):
    if grade < 60:
        letter = 'F'
    elif grade < 70:
        letter = 'D'
    elif grade < 80:
        letter = 'C'
    elif grade < 90:
        letter = 'B'
    else:
        letter = 'A'
    return letter

In [49]:
x['grade_map'] = x['grade'].map(letter_grade)

In [50]:
x

    name   age sex  grade   fruit  sex_map grade_map
0    Zoe  32.0   F   59.0  banana        0         F
1    Sam   NaN   M   65.0   peach        1         D
2  Danny  46.0   M   81.0   apple        1         B

In [51]:
x['grade_apply'] = x['grade'].apply(letter_grade)

In [52]:
x

    name   age sex  grade   fruit  sex_map grade_map grade_apply
0    Zoe  32.0   F   59.0  banana        0         F           F
1    Sam   NaN   M   65.0   peach        1         D           D
2  Danny  46.0   M   81.0   apple        1         B           B

## one-hot encoding

In [55]:
pd.get_dummies(x['fruit'])

   apple  banana  peach
0      0       1      0
1      0       0      1
2      1       0      0

# cut

In [56]:
grades = [45, 82, 56, 77, 90, 69, 72, 79, 85, 95, 62, 65]

In [57]:
pd.cut(grades, 5)

[(44.95, 55.0], (75.0, 85.0], (55.0, 65.0], (75.0, 85.0], (85.0, 95.0], ..., (75.0, 85.0], (75.0, 85.0], (85.0, 95.0], (55.0, 65.0], (55.0, 65.0]]
Length: 12
Categories (5, interval[float64, right]): [(44.95, 55.0] < (55.0, 65.0] < (65.0, 75.0] < (75.0, 85.0] < (85.0, 95.0]]

In [58]:
df = pd.DataFrame({'grades': grades, 'cut': pd.cut(grades, 5)})
df

    grades            cut
0       45  (44.95, 55.0]
1       82   (75.0, 85.0]
2       56   (55.0, 65.0]
3       77   (75.0, 85.0]
4       90   (85.0, 95.0]
5       69   (65.0, 75.0]
6       72   (65.0, 75.0]
7       79   (75.0, 85.0]
8       85   (75.0, 85.0]
9       95   (85.0, 95.0]
10      62   (55.0, 65.0]
11      65   (55.0, 65.0]

In [59]:
df.iloc[0, 1]

Interval(44.95, 55.0, closed='right')

In [60]:
df.iloc[1, 1]

Interval(75.0, 85.0, closed='right')

In [62]:
df.iloc[0, 1] > df.iloc[1, 1]

False

In [63]:
df['cut'].value_counts()

(75.0, 85.0]     4
(55.0, 65.0]     3
(65.0, 75.0]     2
(85.0, 95.0]     2
(44.95, 55.0]    1
Name: cut, dtype: int64

In [64]:
df['letter_cut'] = pd.cut(grades, 5, labels=['F', 'D', 'C', 'B', 'A'])
df

    grades            cut letter_cut
0       45  (44.95, 55.0]          F
1       82   (75.0, 85.0]          B
2       56   (55.0, 65.0]          D
3       77   (75.0, 85.0]          B
4       90   (85.0, 95.0]          A
5       69   (65.0, 75.0]          C
6       72   (65.0, 75.0]          C
7       79   (75.0, 85.0]          B
8       85   (75.0, 85.0]          B
9       95   (85.0, 95.0]          A
10      62   (55.0, 65.0]          D
11      65   (55.0, 65.0]          D

## qcut

In [65]:
pd.qcut(grades, 5)

[(44.999, 62.6], (78.2, 84.4], (44.999, 62.6], (70.2, 78.2], (84.4, 95.0], ..., (78.2, 84.4], (84.4, 95.0], (84.4, 95.0], (44.999, 62.6], (62.6, 70.2]]
Length: 12
Categories (5, interval[float64, right]): [(44.999, 62.6] < (62.6, 70.2] < (70.2, 78.2] < (78.2, 84.4] < (84.4, 95.0]]

In [67]:
df['qcut'] = pd.qcut(grades, 5)
df

    grades            cut letter_cut            qcut
0       45  (44.95, 55.0]          F  (44.999, 62.6]
1       82   (75.0, 85.0]          B    (78.2, 84.4]
2       56   (55.0, 65.0]          D  (44.999, 62.6]
3       77   (75.0, 85.0]          B    (70.2, 78.2]
4       90   (85.0, 95.0]          A    (84.4, 95.0]
5       69   (65.0, 75.0]          C    (62.6, 70.2]
6       72   (65.0, 75.0]          C    (70.2, 78.2]
7       79   (75.0, 85.0]          B    (78.2, 84.4]
8       85   (75.0, 85.0]          B    (84.4, 95.0]
9       95   (85.0, 95.0]          A    (84.4, 95.0]
10      62   (55.0, 65.0]          D  (44.999, 62.6]
11      65   (55.0, 65.0]          D    (62.6, 70.2]

In [69]:
df['qcut'].value_counts()

(44.999, 62.6]    3
(84.4, 95.0]      3
(62.6, 70.2]      2
(70.2, 78.2]      2
(78.2, 84.4]      2
Name: qcut, dtype: int64

In [70]:
df['cut'].value_counts()

(75.0, 85.0]     4
(55.0, 65.0]     3
(65.0, 75.0]     2
(85.0, 95.0]     2
(44.95, 55.0]    1
Name: cut, dtype: int64

In [71]:
df['letter_qcut'] = pd.qcut(grades, 5, labels=['F', 'D', 'C', 'B', 'A'])
df

    grades            cut letter_cut            qcut letter_qcut
0       45  (44.95, 55.0]          F  (44.999, 62.6]           F
1       82   (75.0, 85.0]          B    (78.2, 84.4]           B
2       56   (55.0, 65.0]          D  (44.999, 62.6]           F
3       77   (75.0, 85.0]          B    (70.2, 78.2]           C
4       90   (85.0, 95.0]          A    (84.4, 95.0]           A
5       69   (65.0, 75.0]          C    (62.6, 70.2]           D
6       72   (65.0, 75.0]          C    (70.2, 78.2]           C
7       79   (75.0, 85.0]          B    (78.2, 84.4]           B
8       85   (75.0, 85.0]          B    (84.4, 95.0]           A
9       95   (85.0, 95.0]          A    (84.4, 95.0]           A
10      62   (55.0, 65.0]          D  (44.999, 62.6]           F
11      65   (55.0, 65.0]          D    (62.6, 70.2]           D

In [76]:
pd.cut(grades, 5, right=False)

[[45.0, 55.0), [75.0, 85.0), [55.0, 65.0), [75.0, 85.0), [85.0, 95.05), ..., [75.0, 85.0), [85.0, 95.05), [85.0, 95.05), [55.0, 65.0), [65.0, 75.0)]
Length: 12
Categories (5, interval[float64, left]): [[45.0, 55.0) < [55.0, 65.0) < [65.0, 75.0) < [75.0, 85.0) < [85.0, 95.05)]

In [75]:
pd.cut(grades, 5)

[(44.95, 55.0], (75.0, 85.0], (55.0, 65.0], (75.0, 85.0], (85.0, 95.0], ..., (75.0, 85.0], (75.0, 85.0], (85.0, 95.0], (55.0, 65.0], (55.0, 65.0]]
Length: 12
Categories (5, interval[float64, right]): [(44.95, 55.0] < (55.0, 65.0] < (65.0, 75.0] < (75.0, 85.0] < (85.0, 95.0]]